{
    "nav": {
        "about": "Vorstellung",
        "skills": "Skills",
        "projects": "Portfolio"
    },

    "welcome": {
    "button": "Mein Portfolio",
    "button2": "Schreiben Sie mir",
    "span1": "Offen für Anfragen",
    "span2": "Standort Steinfeld ( Oldenburg )",
    "span3": "Verfügbar für Homeoffice",
    "span4": "Frontend Developer"
    },

    "aboutme": {
      "title": "Wer ich bin",
      "aboutme-title": "Über mich",
      "text-one": "Hallo, mein Name ist Marcel, und ich bin ein deutschsprachiger Frontend-Entwickler aus Steinfeld (Oldenburg). Inspiriert von den grenzenlosen Möglichkeiten der IT, bin ich leidenschaftlich daran interessiert, optisch ansprechende und intuitive Webseiten zu erstellen.",
      "text-two": "Ich bin vielseitig einsetzbar und arbeite sowohl vor Ort in Steinfeld (Oldenburg) als auch remote effektiv. Meine Anpassungsfähigkeit ermöglicht es mir, mich nahtlos in Teams zu integrieren oder unabhängig an Projekten zu arbeiten, wobei ich stets klare Kommunikation und einen strukturierten Arbeitsansatz beibehalte.",
      "text-three": "Ich bin offen für neue Ideen und strebe kontinuierlich nach persönlicher Weiterentwicklung. Auf der Suche nach spannenden Herausforderungen sehe ich jede Aufgabe als Chance, mein Wissen und meine Fähigkeiten auf die nächste Ebene zu heben.",
      "text-four": "Für mich geht Programmieren über das bloße Schreiben von Code hinaus – es ist ein kreativer Ansatz zur Lösung von Problemen. Ich bin stolz darauf, komplexe technische Herausforderungen in intuitive, benutzerfreundliche Lösungen zu verwandeln. So helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken."
    },
    "skills": {
      "title": "Technologien",
      "skillset": "Fähigkeiten",
      "text-skillset": "Im Rahmen meiner Ausbildung im Frontend Bereich habe ich an verschiedenen Projekten gearbeitet und dabei eine Vielzahl von Technologien und Konzepten genutzt. Ich bin offen für neue Ansätze, um meine Fähigkeiten kontinuierlich zu erweitern und auf dem neuesten Stand zu bleiben.",
      "second-title": "Benötigen Sie eine zusätzliche Fähigkeit?",
      "second-text": "Zögern Sie nicht, mich zu kontaktieren. Ich freue mich darauf, mein bisheriges Wissen zu erweitern und neue Erfahrungen zu sammeln.",
      "button": "Kontaktieren Sie mich",
      "mindset": "Ich habe ein besonderes Interesse am Lernen"
    },

    "projects": {
    "title": "Ausgewählte Projekte",
    "text": "Entdecken Sie eine Auswahl meiner Arbeiten hier",
    "text2": "Interagieren Sie mit meinen Projekten, um meine Fähigkeiten in Aktion zu sehen."
  },

  "project-info": {
    "subtitle": "Aufgabenmanager Tool",
    "description": "Ein Kanban-inspirierter Aufgabenmanager ermöglicht es, Aufgaben per Drag-and-Drop zu organisieren, Nutzern und Kategorien zuzuweisen und den Fortschritt auf einem übersichtlichen Board zu verfolgen.",
    "subtitle1": "2D Jump and Run Spiel",
    "description1": "Hilf Pepe in einem actiongeladenen Jump-and-Run-Spiel, Münzen und Tabasco-Salsa zu sammeln, um sich gegen die verrückte Henne zu verteidigen, indem du geschickt springst, rennst und Objekte wirfst.",
    "button": "Next project"
  },

  "references": {
    "title": "Was meine Kollegen über mich sagen",
      "textbox1": "Marcel hat sich als äußerst verlässlicher Teamkollege erwiesen. Seine technischen Fähigkeiten und sein proaktives Handeln waren entscheidend für den Erfolg unseres Projekts.",
      "textbox2": "Marcels ruhige Art hat uns geholfen, stets fokussiert an unseren Aufgaben zu arbeiten. Seine technischen Fähigkeiten waren von großem Wert für den Projekterfolg.",
      "textbox3": "Die Zusammenarbeit mit Marcel ist immer eine Freude. Er bringt frische Ideen und kreative Lösungen mit ein."
  },

  "imprint": {
    "title": "Impressum",
    "subtitle": "Angaben gemäß § 5 TMG",
    "subtitle2": "Vertreten durch",
    "contact": "Kontakt"
  },

  "contact": {
    "contact": "Kontakt",
    "title": "Arbeiten",
    "title1": "wir zusammen",
    "title2": "Gibt es ein Problem zu lösen?",
    "textbox": "Kontaktieren Sie mich über das Formular. Ich bin daran interessiert,",
    "textbox1": "von Ihnen zu hören,Ihre Ideen kennenzulernen und mit meiner Arbeit zu Ihren Projekten beizutragen.",
    "textbox2": "Sie benötigen einen Frontend Entwickler?",
    "span": "Schreiben sie mir"
  },
  "contactform": {
    "name": "Dein Name",
    "email": "Deine Email",
    "message": "Deine Nachricht",
    "button": "Sag Hallo ;)"
  },
  "placeholder": {
    "name": "Hier dein Namen eingeben",
    "email": "Deine@email.de",
    "message": "Hallo Marcel, ich bin interessiert..."
  },
  "policy": {
    "text1": "Ich habe die",
    "text2": "Datenschutzbestimmungen",
    "text3": "gelesen und stimme der Verarbeitung meiner Daten zu."
  }
  }
  