{
"nav": {
        "about": "About me",
        "skills": "Skills",
        "projects": "Projects"
    },

  "welcome": {
    "button": "Projects",
    "button2": "Contact",
    "span1": "Open to work",
    "span2": "Based in Steinfeld ( Oldenburg )",
    "span3": "Available for remote work",
    "span4": "Frontend Developer"
  },

    "aboutme": {
    "title": "Who I am",
    "aboutme-title": "About me",
    "text-one": "Hello, my name is Marcel, and I'm a German-speaking frontend developer from Steinfeld (Oldenburg). Inspired by the limitless possibilities of IT, I am passionate about creating visually appealing and intuitive website.",
    "text-two": "I am versatile and perform effectively both on-site in Steinfeld ( Oldenburg ) and remotely. My adaptability enables me to seamlessly integrate into teams or work independently on projects, always maintaining clear communication and a structured approach to my work.",
    "text-three": "I am receptive to new ideas and consistently strive for personal development. Always seeking exciting challenges, I view each task as an opportunity to elevate my knowledge and skills to the next level.",
    "text-four": "For me, programming goes beyond just writing code—it's a creative approach to solving problems. I take pride in simplifying complex technical challenges into intuitive, user-friendly solutions. This is how I help you achieve your goals and bring your visions to life."
  },

  "skills": {
    "title": "Technologies",
    "skillset": "Skill Set",
    "text-skillset": "During my frontend development training, I have gained experience by working on different projects, applying a variety of technologies and concepts. I’m always eager to explore new methods and approaches to further develop my skills and stay up to date in the fast-paced field of web development.",
    "second-title": "Do you need an additional skill?",
    "second-text": "Feel free to contact me. I look forward to expanding on my previous knowledge and gaining new experiences.",
    "button": "Let's talk",
    "mindset": "I have a  special interest in learning"
  },

  "projects": {
    "title": "Featured Projects",
    "text": "Discover a selection of my work here and",
    "text2": "interact with my projects to see my skills in action."
  },

  "project-info": {
    "subtitle": "Task Managment Tool",
    "description": "Task manager inspired by the Kanban System. Create and organize task using drag and drop functions, assign users and categories",
    "subtitle1": "2D Jump and Run Game",
    "description1": "Jump, run and throw game based on object-oriented approach. Help Pepe to find Coins and tabasco salsa to fight against the crazy hen.",
    "button": "Next project"
  },

  "references": {
    "title": "What my colleagues say about me",
      "textbox1": "Marcel has proven to be an incredibly reliable team member. His technical skills and proactive approach were key to the success of our project.",
      "textbox2": "Marcel's calm demeanor helped us stay focused on our tasks. His technical expertise was highly valuable to the project's success.",
      "textbox3": "Working with Marcel is always a pleasure. He brings fresh ideas and creative solutions to the table."
  },

  "imprint": {
    "title": "Legal Notice",
    "subtitle": "Information pursuant to § 5 TMG",
    "subtitle2": "Represented by",
    "contact": "Contact"
}
}